---
kind: method
id: M:Autodesk.Revit.UI.UIFabricationUtils.SetOpenConnectorIndicatorAwayColor(Autodesk.Revit.DB.Color)
source: html/e2afcc60-d724-3aad-e8c7-6c1f36b92b49.htm
---
# Autodesk.Revit.UI.UIFabricationUtils.SetOpenConnectorIndicatorAwayColor Method

Sets the color of the open connector indicator in away direction

## Syntax (C#)
```csharp
public static void SetOpenConnectorIndicatorAwayColor(
	Color color
)
```

## Parameters
- **color** (`Autodesk.Revit.DB.Color`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null